app/controllers/shop_controller.rb

SELECT "shops".* FROM "shops" WHERE ("shops"."rankin" BETWEEN 2.0 AND 100000000.0)  ORDER BY "shops"."rankin" DESC
---
  def index
    @shop = Shop.all.order(rankin: :desc)